In [1]:
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
casts=pd.read_csv('cast.csv',index_col=None,encoding='utf-8')

In [4]:
c=casts

Merge->(i) merge with same file and (ii) Merge with different file

In [5]:
release = pd.read_csv('release_dates.csv', index_col=None)

In [7]:
release.head()

                    title  year      country        date
0   #73, Shaanthi Nivaasa  2007        India  2007-06-15
1                 #Beings  2015      Romania  2015-01-29
2               #Declimax  2018  Netherlands  2018-01-21
3  #Ewankosau saranghaeyo  2015  Philippines  2015-01-21
4                 #Horror  2015          USA  2015-11-20

In [8]:
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [27]:
#name = c[c['name']=='Amelia’]
name1=  c[c['title'] == 'Amelia']

In [32]:
name1.head()

        title  year            name   type    character     n
5767   Amelia  2009    Aaron Abrams  actor  Slim Gordon   8.0
23319  Amelia  2009  Jeremy Akerman  actor      Sheriff  19.0

In [24]:
r=release

In [29]:
name2=r[r['title']=='Amelia']

In [31]:
name2.head()

        title  year    country        date
20543  Amelia  1966     Mexico  1966-03-10
20544  Amelia  2009     Canada  2009-10-23
20545  Amelia  2009        USA  2009-10-23
20546  Amelia  2009  Australia  2009-11-12
20547  Amelia  2009  Singapore  2009-11-12

In [ ]:
# I want to check release date of Moview 'Amelia' So I have to take help from both of the files

Since there is not entry for Amelia-1966 in casts DataFrame, therefore merge command will not merge the
Amelia-1966 release dates. In following results, we can see that only Amelia 2009 release dates are merges
with casts DataFrame.

In [33]:
name1.merge(release).head()

    title  year          name   type    character    n    country        date
0  Amelia  2009  Aaron Abrams  actor  Slim Gordon  8.0     Canada  2009-10-23
1  Amelia  2009  Aaron Abrams  actor  Slim Gordon  8.0        USA  2009-10-23
2  Amelia  2009  Aaron Abrams  actor  Slim Gordon  8.0  Australia  2009-11-12
3  Amelia  2009  Aaron Abrams  actor  Slim Gordon  8.0  Singapore  2009-11-12
4  Amelia  2009  Aaron Abrams  actor  Slim Gordon  8.0    Ireland  2009-11-13

#### Merge table with itself: 
Suppose, we want see the list of co-actors in the movies.For this, we need to merge the table with itself based on
the title and year, as shown below. In the below code, co-star for actor ‘Aaron Abrams’ are displayed,

In [34]:
c=casts[casts['name']=='Aaron Abrams']

In [36]:
c.head(2)

                   title  year          name   type       character    n
5765       #FromJennifer  2017  Aaron Abrams  actor  Ralph Sinclair  NaN
5766  388 Arletta Avenue  2011  Aaron Abrams  actor            Alex  4.0

Next, to find the co-stars, merge the DataFrame with itself based on ‘title’ and ‘year’ i.e. for being a co-star,
the name of the movie and the year must be same,

In [40]:
c.merge(casts, on=['title', 'year']).head()## ?

,title,year,name_x,type_x,character_x,n_x,name_y,type_y,character_y,n_y
0,#FromJennifer,2017,Aaron Abrams,actor,Ralph Sinclair,NaN,Aaron Abrams,actor,Ralph Sinclair,NaN
1,388 Arletta Avenue,2011,Aaron Abrams,actor,Alex,4.0,Aaron Abrams,actor,Alex,4.0
2,Amelia,2009,Aaron Abrams,actor,Slim Gordon,8.0,Aaron Abrams,actor,Slim Gordon,8.0
3,At Home by Myself... with You,2009,Aaron Abrams,actor,Guy,2.0,Aaron Abrams,actor,Guy,2.0
4,Cinderella Man,2005,Aaron Abrams,actor,1928 Fan,67.0,Aaron Abrams,actor,1928 Fan,67.0

The problem with above joining is that it displays the ‘Aaron Abrams’ as his co-actor as well (see first row). This
problem can be avoided as below,

In [41]:
c_costar = c.merge (casts, on=['title', 'year'])
c_costar = c_costar[c_costar['name_y'] != 'Aaron Abrams']
c_costar.head()

,title,year,name_x,type_x,character_x,n_x,name_y,type_y,character_y,n_y
1,#FromJennifer,2017,Aaron Abrams,actor,Ralph Sinclair,NaN,Christian Ackerman,actor,Simon,NaN
2,388 Arletta Avenue,2011,Aaron Abrams,actor,Alex,4.0,Graham Abbey,actor,Officer #2,8.0
5,Amelia,2009,Aaron Abrams,actor,Slim Gordon,8.0,Jeremy Akerman,actor,Sheriff,19.0
8,Cinderella Man,2005,Aaron Abrams,actor,1928 Fan,67.0,Nick Alachiotis,actor,Baer Cornerman,38.0
9,Cinderella Man,2005,Aaron Abrams,actor,1928 Fan,67.0,Nick Alachiotis,actor,Undercard Boxer - Feldman,38.0